In [ ]:
import pandas as pd
import numpy as np

In [20]:
df = pd.read_csv('data.csv')
df.head()

    NIK  Nilai
0  1239     80
1  1010     90
2  1011     80
3  1001     90
4  1111     60

In [21]:
df2 = df[['Nilai']].astype('int64')
df2.head()

   Nilai
0     80
1     90
2     80
3     90
4     60

In [22]:
np_max = df2.max()
np_max.head()

Nilai    90
dtype: int64

In [23]:
score_max = 100

In [24]:
df3 = df2 / score_max
df3.head()

   Nilai
0    0.8
1    0.9
2    0.8
3    0.9
4    0.6

In [26]:
df4 = df3 * 100
df4.head()

   Nilai
0   80.0
1   90.0
2   80.0
3   90.0
4   60.0